Repository: localizethedocs/mlx-docs-l10n
Catalog: */LC_MESSAGES/python/*.po
Languages: nn

source: Neural Networks
nn: 神經網路

source: Writing arbitrarily complex neural networks in MLX can be done using only :class:`mlx.core.array` and :meth:`mlx.core.value_and_grad`. However, this requires the user to write again and again the same simple neural network operations as well as handle all the parameter state and initialization manually and explicitly.
nn: 在 MLX 中撰寫任意複雜的神經網路，只需使用 :class:`mlx.core.array` 與 :meth:`mlx.core.value_and_grad` 即可。然而，這需要使用者一再撰寫相同的簡單神經網路操作，並且手動且明確地處理所有參數狀態與初始化。

source: The module :mod:`mlx.nn` solves this problem by providing an intuitive way of composing neural network layers, initializing their parameters, freezing them for finetuning and more.
nn: :mod:`mlx.nn` 模組提供直覺的方式來組合神經網路層、初始化其參數、在微調時凍結參數等，從而解決此問題。

source: Quick Start with Neural Networks
nn: 神經網路快速開始

source: The Module Class
nn: Module 類別

source: The workhorse of any neural network library is the :class:`Module` class. In MLX the :class:`Module` class is a container of :class:`mlx.core.array` or :class:`Module` instances. Its main function is to provide a way to recursively **access** and **update** its parameters and those of its submodules.
nn: 任何神經網路程式庫的主力都是 :class:`Module` 類別。在 MLX 中，:class:`Module` 類別是 :class:`mlx.core.array` 或 :class:`Module` 實例的容器。它的主要功能是提供遞迴 **存取** 與 **更新** 其參數及其子模組參數的方法。

source: Parameters
nn: 參數

source: A parameter of a module is any public member of type :class:`mlx.core.array` (its name should not start with ``_``). It can be arbitrarily nested in other :class:`Module` instances or lists and dictionaries.
nn: 模組的參數是任何型別為 :class:`mlx.core.array` 的公開成員（名稱不應以 ``_`` 開頭）。它可以任意地巢狀在其他 :class:`Module` 實例或清單與字典中。

source: :meth:`Module.parameters` can be used to extract a nested dictionary with all the parameters of a module and its submodules.
nn: 可使用 :meth:`Module.parameters` 提取包含模組及其子模組所有參數的巢狀字典。

source: A :class:`Module` can also keep track of "frozen" parameters. See the :meth:`Module.freeze` method for more details. :meth:`mlx.nn.value_and_grad` the gradients returned will be with respect to these trainable parameters.
nn: :class:`Module` 也可以追蹤「凍結」的參數。詳情請見 :meth:`Module.freeze` 方法。:meth:`mlx.nn.value_and_grad` 回傳的梯度會以這些可訓練參數為對象。

source: Updating the Parameters
nn: 更新參數

source: MLX modules allow accessing and updating individual parameters. However, most times we need to update large subsets of a module's parameters. This action is performed by :meth:`Module.update`.
nn: MLX 模組允許存取與更新個別參數。然而，多數時候需要更新模組參數的大型子集合。此動作由 :meth:`Module.update` 進行。

source: Inspecting Modules
nn: 檢視模組

source: The simplest way to see the model architecture is to print it. Following along with the above example, you can print the ``MLP`` with:
nn: 最簡單的檢視模型架構方式是直接列印。延續上方範例，你可以用以下方式列印 ``MLP``：

source: This will display:
nn: 輸出會是：

source: To get more detailed information on the arrays in a :class:`Module` you can use :func:`mlx.utils.tree_map` on the parameters. For example, to see the shapes of all the parameters in a :class:`Module` do:
nn: 若要取得 :class:`Module` 中陣列的更詳細資訊，可以在參數上使用 :func:`mlx.utils.tree_map`。例如，查看 :class:`Module` 中所有參數的形狀可使用：

source: As another example, you can count the number of parameters in a :class:`Module` with:
nn: 另一個例子，你可以用以下方式計算 :class:`Module` 的參數數量：

source: Value and Grad
nn: Value 與 Grad

source: Using a :class:`Module` does not preclude using MLX's high order function transformations (:meth:`mlx.core.value_and_grad`, :meth:`mlx.core.grad`, etc.). However, these function transformations assume pure functions, namely the parameters should be passed as an argument to the function being transformed.
nn: 使用 :class:`Module` 並不妨礙使用 MLX 的高階函式變換（:meth:`mlx.core.value_and_grad`、:meth:`mlx.core.grad` 等）。然而，這些函式變換假設函式是純函式，也就是應將參數作為被變換函式的引數傳入。

source: There is an easy pattern to achieve that with MLX modules
nn: 使用 MLX 模組有個簡單的模式可以做到這點

source: However, :meth:`mlx.nn.value_and_grad` provides precisely this pattern and only computes the gradients with respect to the trainable parameters of the model.
nn: 然而，:meth:`mlx.nn.value_and_grad` 正好提供了這個模式，且只會計算模型可訓練參數的梯度。

source: In detail:
nn: 詳細來說：

source: it wraps the passed function with a function that calls :meth:`Module.update` to make sure the model is using the provided parameters.
nn: 它會用一個函式包裹傳入的函式，該函式會呼叫 :meth:`Module.update`，確保模型使用所提供的參數。

source: it calls :meth:`mlx.core.value_and_grad` to transform the function into a function that also computes the gradients with respect to the passed parameters.
nn: 它會呼叫 :meth:`mlx.core.value_and_grad`，將函式轉換為同時計算對傳入參數的梯度的函式。

source: it wraps the returned function with a function that passes the trainable parameters as the first argument to the function returned by :meth:`mlx.core.value_and_grad`
nn: 它會再以一個函式包裹回傳的函式，將可訓練參數作為第一個引數傳給 :meth:`mlx.core.value_and_grad` 回傳的函式。

source: Transform the passed function ``fn`` to a function that computes the gradients of ``fn`` wrt the model's trainable parameters and also its value.
nn: 將傳入的函式 ``fn`` 轉換為同時計算 ``fn`` 對模型可訓練參數的梯度與其值的函式。
